cask_args appdir: "/Applications"

tap "thoughtbot/formulae"

# terminal work
brew "ack"
brew "aria2"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "gum"
brew "libxslt"
brew "libxml2"
brew "mas"
brew "node"
brew "rcm"
brew "ssh-copy-id"
brew "starship"
brew "watch"
brew "wget"
brew "yt-dlp"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "font-xkcd-script"

# Development
brew "buildpacks/tap/pack"
brew "chruby"
cask "docker"
brew "elixir"
cask "github"
cask "intellij-idea-ce"
brew "postgresql"
brew "openjdk"
brew "pandoc"
brew "pstree"
brew "qt"
brew "ruby-install"
cask "rubymine"
brew "tree"
cask "visual-studio-code"
cask "zed"

# MacOS Utilities
cask "1password"
cask "1password-cli"
cask "fertigt-slate" # Slate support for Apple Silicon; NOTE: For Intel, need to get the DMG/App from elsewhere
cask "flycut"

# MacOS Apps
#cask "bricklink-studio"
cask "deckset"
#cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "ia-presenter"
cask "notion"
cask "obsidian"
cask "quicken"
cask "signal"
cask "slack"
cask "spatterlight"
#cask "xquartz"
#cask "xscope"
cask "zoom"

# Mac App Store apps YMMV; Use 'mas list' to get your App IDs
mas "Daisy Disk", id: 411643860
mas "Marked 2", id: 890031187
mas "ToDoist", id: 585829637
mas "Paprika Recipe Manager 3", id: 1303222628
